title: Multiple Failed Logins - Brute Force
status: stable
description: Detects brute force authentication attempts
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4625
    timeframe: 10m
    condition: selection | count() > 5
falsepositives:
    - Forgotten passwords
level: high
tags:
    - attack.credential_access
    - attack.t1110
